

let t1 = `B---
标题: "投资系统的升级"
创建时间: 2023-04-19 15:37
---


## 投资系统的升级 
#投资 #五彩划线 2023-04-19 15:37 [原文](https://mp.weixin.qq.com/s?__biz=MzA5NjM0Nzc3NA==&mid=2650437485&idx=1&sn=a5c9f94015f1be7ac2feaa43f4049876&chksm=88bfa47cbfc82d6a9be1bb18cc9bdde04aa465d1998ca48ede28eb293721bf12f4633cbf98a5&scene=178&cur_album_id=1299499945833234432#rd)

begin pagenote
end pagenote

## Page Notes
A%%begin pagenote%%B

C%%end pagenote%%D

## 划线列表
%%begin highlights%%
> <font color="#D9C3FF">█  </font>我曾经2017年的文章《要想在股票投资上「赚大钱」，只要牢牢记住下面四句话》中总结过自己的投资系统，如下：第一、找一个有护城河的公司第二、在合适的价格买入第三、持有足够长的时间第四、投入足够多的钱

> <font color="#FFC7BA">█  </font>但是，在具体执行的时候，我并没有忠实的执行这个系统，问题出在对第二条和第四条的理解上，尤其是第二条：到底什么才是合适的价格。对于第二条的理解不清晰，导致第四条无法执行。比如，我在过去三四年没有任何买入，因为觉得相比于当初的买入价，都太高了（比如我买茅台的平均成本是130元，在2014年开始买苹果的时候其市盈率只有9倍）。在过去的四五年里，相比于这个价格，我再也找不到更好的公司股票可以买，即使对茅台和苹果，也无法再次入手。

> <font color="#FFC7BA">█  </font>我经常在问自己：我在等什么？难道在等待这些公司的股票跌回我第一次买入时的价格吗？虽然从内心深处觉得这种时机不会再有，但是有锚定心理作祟，总是在想购买时犹犹豫豫不加仓，后来就干脆等着什么也不做。基于与最初买入价格的对比造成的纠结，从表面看是任何股票也不买入，也不加仓茅台和苹果，但最深的影响其实是：在过去四年，我没有给股票账户注入新的资金。

> <font color="#A6FFE9">█  </font>上周在与大学好友的讨论中，我突然意识到，长线投资的关键点不在于以多低的价格购买股票，而是在于能如何在价格合适的时候积极扩大投入的本金规模。也就是说，我们不用太在意是否一定在最低点，和过去一次买入相比价格是否相同甚至更低，我们要在意的是不断投入更多本金在合理价格区间买买买。所以，评价投资的能力，最重要的不是在比较盈利倍数，而是管理本金的规模。大家在学习巴菲特的智慧时，不要仅仅只看他买了什么股票，而要看他的股票资金从哪里来，有多大规模。这件事情，甚至比他选择哪只股票更重要。

> <font color="#D9C3FF">█  </font>所以，在我们自己的衡量指标中，我们要去掉「赚多少倍」或者「赚百分之多少」的概念（这不是巴菲特要关注的事情，这是伯克希尔·哈撒韦股票的投资者所关注的事情），而是要关注：第一、投入股市的本金总规模有多大？第二、在价格合理的区间是否投入足够多的本金去购买优质公司？第三、如何在未来获得更多本金？

> <font color="#A6FFE9">█  </font>所以，对我而言，价值投资从本质上讲不是在管理价格，而是在管理本金规模。这个认知的改变能彻底解决我在过去5年的投资困惑。 说白了，价值投资者一生是买家，他的终身信条就是「买买买」，不断的买入并持有好公司。没有更多的钱，怎么能买买买呢？

> <font color="#FFC7BA">█  </font>请问，「不断买入」的钱从哪里来？我觉得这取决于两方面，第一是你筹措资金的渠道和方式；第二是你对于股市投资的信心，二者缺一不可。只有前者，你有钱也不敢投入股市，只敢存着或者花掉；只有后者，你也是巧妇难为无米之炊。巴菲特的「买买买」的钱来自哪里？来自他所拥有的保险公司的浮存金。有了这个源源不断的本金源头，他才有机会不断寻找价格合理的股票，源源不断的投入股市。巴菲特投资的信心从哪里来？来自于他真正懂得生意，懂得经营。知道钱从哪里来，到哪里去。若想好好了解巴菲特，最佳方法是看《巴菲特致股东的信》（每年一封），除此之外的方法就是反复看这些信。这些信里所说的，与其说是「投资秘密」，不如说是「企业经营理念」。

> <font color="#FFC7BA">█  </font>所以，是否真正遵循价值投资理念，就看两件事：第一，懂生意，懂公司经营；第二，知道如何筹措资金，如何管理投资的资金池。二者缺一不可。前者决定投哪家公司以及持有时间；后者决定能有多少钱投这家公司。巴菲特的智慧解决了第一个问题，而巴菲特的保险公司浮存金解决了第二个问题。因此实践中，价值投资者要做好两件要事，第一有办法不断扩大本金规模；第二在合适的机会点大笔买入看好的公司；这两者缺一不可，基于这些反思，我把自己的投资系统调整为：目标：在股市持续投入足够多的钱关键结果：第一、找一个有护城河的公司第二、在合适的价格大量买入第三、持有足够长的时间

> <font color="#A6FFE9">█  </font>在原有的系统中，四条条件没有主次之分。但是在具体执行的时候，会把「合适的价格买入」变成首要条件。遵守这个条件可以确保自己不亏，但是却无法保证自己持续赚大钱。但是，在新的系统中，核心目标变成了「在股市投入足够多的钱」，其他三条则变成了手段。并且把「在合适价格买入」，调整为「在合适的价格大量买入」，看起来只是变了一点点，在具体执行时会有天壤之别。

> <font color="#FFC7BA">█  </font>在新的系统下，「合适的价格」有了更加明确的判断标准，比如我把「10年预期收入超过同期银行」作为判断价格是否合适的条件。这个条件下，可以凭借常识和估算，判断出合适的买点 —— 不用等到最便宜才买，差不多就可以买。在这个条件下，你也不会太纠结是否错过了刚刚发生的「抄底」时机。很多人热衷于抄底，但是幸运抄到低的人，最大的失败是投入的资金不够。所以，赢了倍数，失了规模，不是赢，是大败。

> <font color="#FFC7BA">█  </font>因为这样的思考，我知道更应该在意投资的规模，而不纠结于股价相对高低。所以在上周两天，大举买入茅台。判断逻辑就是：在A股2600点时买入一家优质公司的股票，看十年，怎么着都比存银行强。

> <font color="#A6FFE9">█  </font>相比于谈论我在上周的操作，我更愿意讲的是这个系统迭代带给我后续的变化。第一、我会积极的筹措更多的资金进入股市，而不是像过去四年一样消极（副作用是大笔花钱买了其他大件消费品 —— 这是没有投资目标时常犯的错误）。这会让我进入股市的资金规模越来越大。而不断扩大本金规模，正是整个新的投资系统的最终目标。第二、会花更多的时间研究一家公司的基本面，即企业经营层面，因为有更多的身家押在少数几家公司身上。第三、会花更多的功夫去理解企业的经营，因为后续需要更大的信心去使用更大规模的资金。第二和第三条会确保我的确找到了一家有护城河的公司，而且在价格合理时买入。第四、会花更多的时间去研究《巴菲特致股东的信》，因为需要更大的智慧去去拨云见日。这个确保我知道持有一家公司的合理时间（而非永远）。

> <font color="#FFC7BA">█  </font>目标（Objective）清晰，关键结果（Key Results）明确可衡量，这个系统要比第一代系统好很多。

%%end highlights%%

## 其他


END`

function wrapBlock(cnt, name) {
    return `\n%%begin ${name}%%\n${cnt}\n%%end ${name}%%\n`
  }
function replaceHolders(t1, renderHolders) {
    t1 = t1 || ''
    const bns = Object.keys(renderHolders || {})
    bns.forEach((bn) => {
      let exp = holdersRegExpMap[bn]
      if (!exp) {
        return
      }
      let newCnt = (renderHolders[bn] || '').replace(/(^[\r\n]+|[\r\n]+$)/g, '')
      if (!newCnt || newCnt.length <= 0) {
        return
      }
      let matchRet = t1.matchAll(exp)
      if (!matchRet) {
        // append to the end of file
        t1 += this.wrapBlock(newCnt, bn)
        return t1
      }
      let matchC = 0
      for (const match1 of matchRet) {
        let allCnt = match1[1].length
        let coreCnt = match1[2] || ''
        if(coreCnt == newCnt){
            matchC++
            break
        }
        coreCnt = wrapBlock(coreCnt+newCnt, bn)
        let suffixCnt = t1.substring(match1.index+allCnt)
        t1 = t1.substring(0, match1.index) + coreCnt + suffixCnt
        // let newCnt = t1.substring(0, match1.index) + '@newkdkdkdk@\n' + suffixCnt
        matchC++
        break
      }
      if (matchC <= 0) {
        t1 += this.wrapBlock(newCnt, bn)
      }
    })
    return t1
  }

let holdersRegExpMap = {
    highlights: new RegExp('(%%\\s*begin\\s+highlights\\s*%%([\\s\\S]*?)%%\\s*end\\s+highlights\\s*%%)', 'ig'),
    pagenote: new RegExp('(%%\\s*begin\\s+pagenote\\s*%%([\\s\\S]*?)%%\\s*end\\s+pagenote\\s*%%)', 'ig'),
}

let ctx = {
    pagenote:"JACK",
    highlights: "Rose",
}
let r = replaceHolders(t1, ctx)
console.log(r)